In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

============================================

练习16：

1. 假设有两份成绩单，除了ddd是张三李四王老五之外，还有ddd4是张三和赵小六的成绩单，如何合并？

2. 如果ddd4中张三的名字被打错了，成为了张十三，怎么办？

3. 自行练习多对一，多对多的情况  

4. 自学left_index,right_index

============================================

In [4]:
ddd = DataFrame({'name':['张三','李四','王老五'],'语文':[41,55,146],'数学':[16,48,91],'英语':[9,112,81]})
ddd

  name   语文  数学   英语
0   张三   41  16    9
1   李四   55  48  112
2  王老五  146  91   81

In [5]:
ddd4 = DataFrame({'name':['张三','赵小六'],'语文':[87,148],'数学':[124,102],'英语':[127,141]})
ddd4

  name   语文   数学   英语
0   张三   87  124  127
1  赵小六  148  102  141

In [7]:
pd.merge(ddd,ddd4, on='name', suffixes=['_df1','_df2'])

  name  语文_df1  数学_df1  英语_df1  语文_df2  数学_df2  英语_df2
0   张三      41      16       9      87     124     127

In [ ]:
# 张三改成为了张十三的话,表中就没相同的数据了,为了满足合并的需求可以把相同科目的成绩
# 改成至少有一个相同的.